In [25]:
# pip install pandas

In [26]:
# Dependencies and Setup
import pandas as pd
import numpy as np

In [27]:
# File to Load 
file_to_load = "C:\\Users\\cdark\\Desktop\\2021 NU Data Science and Visualization\\05 - Class Work\\19-Project-2\Project work\\Datasets\\01 - Original\\draft.csv"

In [28]:
# Read the Draft data
raw_draft_data = pd.read_csv(file_to_load)
raw_draft_data.head()

,playerId,draft,round,pick,draftTradeValue,draftTeam,position,teamId,nameFirst,nameLast,...,dob,ageAtDraft,playerProfileUrl,homeCity,homeState,homeCountry,highSchool,hsCity,hsState,hsCountry
0,19770001,1977,1.0,1,3000.0,TB,RB,4900,Ricky,Bell,...,1955-04-08,22.084932,http://www.nfl.com/player/RickyBell/2509366/pr...,Houston,TX,USA,NaN,NaN,NaN,NaN
1,19770002,1977,1.0,2,2600.0,DAL,RB,1200,Tony,Dorsett,...,1954-04-07,23.087671,http://www.nfl.com/player/TonyDorsett/2513084/...,Rochester,PA,USA,NaN,NaN,NaN,NaN
2,19770003,1977,1.0,3,2200.0,CIN,DE,920,Eddie,Edwards,...,1954-04-25,23.038356,http://www.nfl.com/player/EddieEdwards/2513479...,Sumter,SC,USA,NaN,NaN,NaN,NaN
3,19770004,1977,1.0,4,1800.0,NYJ,OT,3430,Marvin,Powell,...,1955-08-30,21.690411,http://www.nfl.com/player/MarvinPowell/2523462...,Los Angeles,CA,USA,NaN,NaN,NaN,NaN
4,19770005,1977,1.0,5,1700.0,NYG,DE,3410,Gary,Jeter,...,1955-01-24,22.287671,http://www.nfl.com/player/GaryJeter/2517530/pr...,Weirton,WV,USA,NaN,NaN,NaN,NaN

In [29]:
# Determine the number of entries in data set
count_draft_data = raw_draft_data.loc[:,['draft']]
count_draft_data.count()

draft    12140
dtype: int64

In [30]:
# Look over the dtypes of the dataset
print(raw_draft_data.dtypes)

playerId              int64
draft                 int64
round               float64
pick                  int64
draftTradeValue     float64
draftTeam            object
position             object
teamId                int64
nameFirst            object
nameLast             object
nameFull             object
collegeId             int64
nflId               float64
combineId           float64
college              object
heightInches        float64
weight              float64
dob                  object
ageAtDraft          float64
playerProfileUrl     object
homeCity             object
homeState            object
homeCountry          object
highSchool           object
hsCity               object
hsState              object
hsCountry            object
dtype: object

In [55]:
# Redefine the table with needed colums
raw_draft_data_1 = raw_draft_data.loc[:,['playerId' , 'nameFull','draft', 'round', 'pick', 'draftTradeValue', 'draftTeam' , 'position', 'teamId']]
raw_draft_data_1.head()

,playerId,nameFull,draft,round,pick,draftTradeValue,draftTeam,position,teamId
0,19770001,Ricky Bell,1977,1.0,1,3000.0,TB,RB,4900
1,19770002,Tony Dorsett,1977,1.0,2,2600.0,DAL,RB,1200
2,19770003,Eddie Edwards,1977,1.0,3,2200.0,CIN,DE,920
3,19770004,Marvin Powell,1977,1.0,4,1800.0,NYJ,OT,3430
4,19770005,Gary Jeter,1977,1.0,5,1700.0,NYG,DE,3410

In [56]:
# Data Cleaning with crucial columns: Year
raw_draft_data_1.draft.unique()

array([1977, 1978, 1979, 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987,
       1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998,
       1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009,
       2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019],
      dtype=int64)

In [57]:
# Data Cleaning with crucial columns: Year
raw_draft_data_1.draftTeam.unique()

array(['TB', 'DAL', 'CIN', 'NYJ', 'NYG', 'ATL', 'NO', 'GB', 'KC', 'HO',
       'BUF', 'MIA', 'SEA', 'CHI', 'NE', 'CLV', 'DEN', 'SL', 'PIT', 'LA',
       'SD', 'BLT', 'MIN', 'OAK', 'DET', 'SF', 'WAS', 'PHI', 'LAR', 'IND',
       'ARZ', 'JAX', 'CAR', 'TEN', 'HST', 'LAC', 'ARI', 'HOU', 'BAL',
       'CLE'], dtype=object)

In [58]:
# Data Cleaning with crucial columns: Position
raw_draft_data_1.position.unique()

array(['RB', 'DE', 'OT', 'DT', 'DB', 'LB', 'OG', 'QB', 'TE', 'C', 'WR',
       'NT', 'P', 'FB', 'K', 'OL', 'CB', 'LS', 'OLB', 'OC', 'KR', 'OG-OC',
       'S', 'DL', 'FS', 'CB-S', 'SS', 'LS-TE', 'OL-LS', 'TE-LS', 'DB-WR',
       'RB-FB', 'TE-OT', 'RB-KR', 'DE-LB', 'TE-FB', 'FB-RB-TE', 'DE-OLB',
       'ILB', 'FL', 'TB', 'T', 'SAF', 'G', 'OG/OT'], dtype=object)

In [59]:
dup = raw_draft_data_1.duplicated('playerId')
dup.value_counts()

False    12119
True        21
dtype: int64

In [60]:
dup2 = raw_draft_data_1[raw_draft_data_1.duplicated('playerId')]
dup2.head()

,playerId,nameFull,draft,round,pick,draftTradeValue,draftTeam,position,teamId
9351,20090032,Evander Hood,2009,1.0,32,590.0,PIT,DT,3900
9352,20090032,Evander Hood,2009,1.0,32,590.0,PIT,DT,3900
9353,20090032,Evander Hood,2009,1.0,32,590.0,PIT,DT,3900
9354,20090032,Evander Hood,2009,1.0,32,590.0,PIT,DT,3900
9355,20090032,Evander Hood,2009,1.0,32,590.0,PIT,DT,3900

In [61]:
dup2.value_counts('draftTeam')

draftTeam
PIT    7
SF     7
TB     7
dtype: int64

In [62]:
dup2.value_counts('nameFull')

nameFull
Evander Hood    7
Mike Edwards    7
Mike Person     7
dtype: int64

In [14]:
# Filter table based on decade and team (ATL)
raw_draft_data_2 = raw_draft_data_1[(raw_draft_data_1['draft']>=1970) & (raw_draft_data_1['draft']<=2010) & (raw_draft_data_1['draftTeam']=='ATL') & (raw_draft_data_1['round']==1.0) ]
raw_draft_data_2.head()

      playerId  draft  round  pick  draftTradeValue draftTeam position  teamId
5     19770006   1977    1.0     6           1600.0       ATL       OT     200
19    19770020   1977    1.0    20            850.0       ATL       DT     200
347   19780013   1978    1.0    13           1150.0       ATL       OT     200
685   19790017   1979    1.0    17            950.0       ATL       NT     200
1005  19800007   1980    1.0     7           1500.0       ATL       TE     200

In [11]:
# Count the number of positions drafted.

raw_draft_data_3 = raw_draft_data_2['position'].value_counts()

raw_draft_data_4 = pd.DataFrame(raw_draft_data_3, columns=['position'])

raw_draft_data_4 = raw_draft_data_4.rename(columns={"position":"count"})
raw_draft_data_4 = raw_draft_data_4 .rename_axis("position")

raw_draft_data_5 = raw_draft_data_4.head(5)
raw_draft_data_5

          count
position
OT            5
LB            4
RB            4
WR            4
DT            4

In [12]:
# export the data to be used on d3 bar chart

raw_draft_data_5.to_csv("C:\\Users\\cdark\\Desktop\\2021 NU Data Science and Visualization\\05 - Class Work\\19-Project-2\\Project work\\Radial Bar Chart\\Draft Results.csv")